## Plan for org_account/spend_notifier
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**❌ &nbsp; Conftest:** `failed`





```terraform
Plan: 9 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.daily_budget_spend will be created
  + resource "aws_cloudwatch_event_rule" "daily_budget_spend" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "daily_budget_spend"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 12 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_rule.weekly_budget_spend will be created
  + resource "aws_cloudwatch_event_rule" "weekly_budget_spend" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "weekly_budget_spend"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 12 ? * SUN *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.daily_budget_spend will be created
  + resource "aws_cloudwatch_event_target" "daily_budget_spend" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = (sensitive)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.weekly_budget_spend will be created
  + resource "aws_cloudwatch_event_target" "weekly_budget_spend" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = (sensitive)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # aws_iam_policy.spend_notifier will be created
  + resource "aws_iam_policy" "spend_notifier" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "spend_notifier"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:659087519042:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:659087519042:log-group:/aws/lambda/daily-spend-monitor:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "ce:GetCostAndUsage"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.spend_notifier will be created
  + resource "aws_iam_role" "spend_notifier" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sts:AssumeRole"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "spend_notifier_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.org_read_only will be created
  + resource "aws_iam_role_policy_attachment" "org_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSOrganizationsReadOnlyAccess"
      + role       = "spend_notifier_lambda"
    }

  # aws_iam_role_policy_attachment.spend_notifier will be created
  + resource "aws_iam_role_policy_attachment" "spend_notifier" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "spend_notifier_lambda"
    }

  # aws_lambda_function.spend_notifier will be created
  + resource "aws_lambda_function" "spend_notifier" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/main.py.zip"
      + function_name                  = "spend_notifier"
      + handler                        = "app.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 0
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "MFkIWic3PZhvn0yBNTyHsAJZd2mSp6OTSTvGcXhInms="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.daily_budget_spend"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.weekly_budget_spend"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.spend_notifier"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.spend_notifier"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.spend_notifier"]
FAIL - plan.json - main - Lambda function has invalid runtime: ["aws_lambda_function.spend_notifier"]

22 tests, 16 passed, 5 warnings, 1 failure, 0 exceptions

```

</details>
